Diplom/src/Catalogs/ВКМ_Уведомления_Телеграм_Боту/ВКМ_Уведомления_Телеграм_Боту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Уведомления_Телеграм_Боту</name>
  <attributes>
    <name>Текст_Сообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom/src/CommonModules/ВКМ_Телеграм/Module.bsl
#Область ПрограммныйИнтерфейс  
 
 
 Процедура ВзаимодействиеСТелеграмБотом(ТекстСообщения, Ссылка) Экспорт
	 
	 // Переменные
	 ID_группыВТелеграме = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
	 ТокенУправленияТГБотом = Константы.ВКМ_ТоккенУправленияTB.Получить(); 
	 АдресСервераТелеграм = "api.telegram.org";  
	 Ресурс = "/bot" + ТокенУправленияТГБотом + "/sendMessage";
	 Заголовок_ContentType = "application/json";
	 
	 Заголовки = Новый Соответствие;
	 Заголовки.Вставить("Content-Type", Заголовок_ContentType);
	 
	 //Структура для JSON
	 СтруктураЗапроса = Новый Структура;
	 СтруктураЗапроса.Вставить("chat_id", ID_группыВТелеграме);
	 СтруктураЗапроса.Вставить("text", ТекстСообщения);
	 
	 // Создание JSON       
	 ЗаписьJSON = Новый ЗаписьJSON;
	 ЗаписьJSON.УстановитьСтроку();
	 ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	 СтрокаJSON = ЗаписьJSON.Закрыть(); 
	 
	 //HTTP-соединение
	 ПараметрыПодключения = ПараметрыПодключения(АдресСервераТелеграм, Ресурс);
	 Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервераТелеграм,,,,,,ПараметрыПодключения.ЗащищенноеСоединение);
	 
	 //HTTP-запрос
	 Запрос = Новый HTTPзапрос(ПараметрыПодключения.Ресурс, Заголовки); 
	 Запрос.УстановитьТелоИзСтроки(СтрокаJSON); 
	 
	 //Получаем элемент справочника и проверяем его на отправленность
	 ОбъектСообщение = Ссылка.ПолучитьОбъект();
	 Если НЕ ОбъектСообщение.Отправлено Тогда
		 Ответ = Соединение.Получить(Запрос); //<- отправка в ТГ
		 
		 Если Ответ.КодСостояния <> 200 Тогда
			 ОбщегоНазначения.СообщитьПользователю("Ошибка проверки подключения к телеграм-боту"); 
			 ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();   
			 Комментарий = "Не удалось подключиться к ТГ-боту, ответ сервера " + Ответ.КодСостояния + " // " + ТекстОтвета;    
			 ЗаписьЖурналаРегистрации("Отказ Телеграм-бота", УровеньЖурналаРегистрации.Информация,,,Комментарий);
			 ОбщегоНазначения.СообщитьПользователю("Сообщение НЕ отправлено ..."); 
			 Возврат;
		 КонецЕсли;
		 ОбщегоНазначения.СообщитьПользователю("Сообщение отправлено в Телеграм бот...");
		 ОбъектСообщение.Отправлено = Истина; 
		 ОбъектСообщение.Записать();
	 КонецЕсли;    
	 
 КонецПроцедуры  
 
 Функция ПараметрыПодключения(АдресСервераТелеграм, Ресурс)  
	 
	 Результат = Новый Структура;
	 Результат.Вставить("АдресСервераТелеграм", АдресСервераТелеграм);
	 Результат.Вставить("Ресурс", Ресурс);  
	 Результат.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL);
	 
	 Возврат Результат;
	 
 КонецФункции
 
 Процедура ВКМ_Отправка_Уведомлений_В_ТГ() Экспорт
	 //Регл. задание	
	 Запрос = Новый запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ВКМ_Уведомления_Телеграм_Боту.Текст_Сообщения КАК Текст_Сообщения,
	 |	ВКМ_Уведомления_Телеграм_Боту.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.ВКМ_Уведомления_Телеграм_Боту КАК ВКМ_Уведомления_Телеграм_Боту"; 
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл   
		 //Отправка сообщения
		 ВзаимодействиеСТелеграмБотом(Выборка.Текст_Сообщения, Выборка.Ссылка);  
		 
		 //Удаление Сообщения из справочника если реквизит "Отправлено" = Истина  
		 ОбъектСообщение = Выборка.Ссылка.ПолучитьОбъект();
		 Если ОбъектСообщение.Отправлено Тогда
			 ОбъектСообщение.Удалить();           
		 КонецЕсли;
	 КонецЦикла; 
 КонецПроцедуры
 
 
 #КонецОбласти
